# Pandas Tutorials

Pandas is an open-source Python Library providing high-performance data manipulation and analysis tool using its powerful data structures.

In [6]:
# import pandas lbrary

import pandas as pd
import numpy as np

pandas series

* single dimentional array
* capable of holding an type of data

In [10]:
# series creation from array

data = np.array([1,2,3,4,5])

ser = pd.Series(data)
ser

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [11]:
# series creation from list

list = ["shilpa","shree", "raj"]

ser = pd.Series(list)
ser

0    shilpa
1     shree
2       raj
dtype: object

In [14]:
# accessing eements
ser[:]

0    shilpa
1     shree
2       raj
dtype: object

In [15]:
ser[:2]

0    shilpa
1     shree
dtype: object

In [17]:
list = ["shilpa","shree", "raj"]

ser = pd.Series(list, index = ["fname", "lname", "surname"])
ser

fname      shilpa
lname       shree
surname       raj
dtype: object

In [19]:
ser['fname']

'shilpa'

In [20]:
ser['lname']

'shree'

pandas Dataframe

In [26]:
df = pd.read_csv("weather_data.csv")

In [27]:
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [28]:
df.count()

day            9
temperature    5
windspeed      5
event          7
dtype: int64

In [29]:
df.mean()

C:\Users\venka\AppData\Local\Temp\ipykernel_12368\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

temperature    33.2
windspeed       8.4
dtype: float64

In [30]:
df.max()

C:\Users\venka\AppData\Local\Temp\ipykernel_12368\1151452817.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.max()

day            1/9/2017
temperature        40.0
windspeed          12.0
dtype: object

In [31]:
df.describe()

       temperature  windspeed
count      5.00000   5.000000
mean      33.20000   8.400000
std        4.38178   2.302173
min       28.00000   6.000000
25%       32.00000   7.000000
50%       32.00000   8.000000
75%       34.00000   9.000000
max       40.00000  12.000000

In [32]:
df

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          NaN        9.0   Sunny
2   1/5/2017         28.0        NaN    Snow
3   1/6/2017          NaN        7.0     NaN
4   1/7/2017         32.0        NaN    Rain
5   1/8/2017          NaN        NaN   Sunny
6   1/9/2017          NaN        NaN     NaN
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [34]:
df1 = df.fillna(0)
df1

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017          0.0        9.0   Sunny
2   1/5/2017         28.0        0.0    Snow
3   1/6/2017          0.0        7.0       0
4   1/7/2017         32.0        0.0    Rain
5   1/8/2017          0.0        0.0   Sunny
6   1/9/2017          0.0        0.0       0
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [35]:
df2 = df.fillna(method = 'ffill')
df2

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017         32.0        9.0   Sunny
2   1/5/2017         28.0        9.0    Snow
3   1/6/2017         28.0        7.0    Snow
4   1/7/2017         32.0        7.0    Rain
5   1/8/2017         32.0        7.0   Sunny
6   1/9/2017         32.0        7.0   Sunny
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [36]:
df3 = df.fillna(method = 'bfill')
df3

         day  temperature  windspeed   event
0   1/1/2017         32.0        6.0    Rain
1   1/4/2017         28.0        9.0   Sunny
2   1/5/2017         28.0        7.0    Snow
3   1/6/2017         32.0        7.0    Rain
4   1/7/2017         32.0        8.0    Rain
5   1/8/2017         34.0        8.0   Sunny
6   1/9/2017         34.0        8.0  Cloudy
7  1/10/2017         34.0        8.0  Cloudy
8  1/11/2017         40.0       12.0   Sunny

In [37]:
df4 = df.interpolate()
df4

         day  temperature  windspeed   event
0   1/1/2017    32.000000       6.00    Rain
1   1/4/2017    30.000000       9.00   Sunny
2   1/5/2017    28.000000       8.00    Snow
3   1/6/2017    30.000000       7.00     NaN
4   1/7/2017    32.000000       7.25    Rain
5   1/8/2017    32.666667       7.50   Sunny
6   1/9/2017    33.333333       7.75     NaN
7  1/10/2017    34.000000       8.00  Cloudy
8  1/11/2017    40.000000      12.00   Sunny

In [39]:
print(df.groupby('event'))

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001EB7D4A8400>

In [40]:
df.groupby(['event'])